# CombinableElementArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CombinableElementArrayIterator Class
Members See Also
---
An iterator to an CombinableElement array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CombinableElementArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CombinableElementArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CombinableElementArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CombinableElementArrayIterator
# See Also
CombinableElementArrayIterator Members
Autodesk.Revit.DB Namespace